app/controllers/itineraries_controller.rb

	def index
		@itineraries = Itinerary.all
---
SELECT "itineraries".* FROM "itineraries"