app/controllers/trips_controller.rb

	def create
    @trip = Trip.new(params.require(:trip).permit(:origin, :destination, :searchString, :id))
	  	if @trip.save
---
INSERT INTO "trips" ("created_at", "destination", "origin", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"

	def destroy
	  	Trip.find(params[:id]).destroy
---
DELETE FROM "trips" WHERE "trips"."id" = $1  [["id", 1]]
SELECT  "trips".* FROM "trips"  WHERE "trips"."id" = $1 LIMIT 1  [["id", 1]]