app/controllers/users_controller.rb

	def create
    	@user = User.new(params.require(:user).permit(:first_name, :last_name, :email, :password))
    		if @user.save
---
INSERT INTO "users" ("created_at", "email", "first_name", "last_name", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2014-09-04 23:28:22.193164"], ["email", "test@email.com"], ["first_name", "Lafferty"], ["last_name", "Daniel"], ["updated_at", "2014-09-04 23:28:22.193164"]]